In [2]:
import pandas as pd

impares = [1, 3, 5, 7, 9]

serieImpar = pd.Series(impares)

serieImpar

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
import numpy as np

pares = np.array([0, 2, 4, 6, 8])

seriePar = pd.Series(pares)

seriePar

0    0
1    2
2    4
3    6
4    8
dtype: int32

In [4]:
# refazer a série anterior usando índices alfabéticos:

serieParAlfa = pd.Series(data=pares, index=['a', 'b', 'c', 'd', 'e'])

serieParAlfa

a    0
b    2
c    4
d    6
e    8
dtype: int32

In [5]:
serieParAlfa['c']

4

In [7]:
# pegando valores maiores do que 0 e menores do que 8:

serieParAlfa[ (serieParAlfa > 0) & (serieParAlfa < 8)]

b    2
c    4
d    6
dtype: int32

In [9]:
# multiplicar por 5 todos os valores menores do que 5 ou maiores do que 7

serieImpar[ (serieImpar < 5 ) | (serieImpar > 7)] *= 5

serieImpar

0     5
1    15
2     5
3     7
4    45
dtype: int64

In [10]:
serieImpar.sum()

77

In [11]:
serieImpar.max()

45

In [12]:
serieImpar.std() # desvio padrão (standard deviation)

17.052858997833766

In [14]:
serieImpar.mode() # moda

0    5
dtype: int64

In [15]:
serieImpar.value_counts()

5     2
15    1
45    1
7     1
dtype: int64

In [16]:
serieImpar.value_counts(normalize = True)

5     0.4
15    0.2
45    0.2
7     0.2
dtype: float64

In [17]:
serieImpar.describe()

count     5.000000
mean     15.400000
std      17.052859
min       5.000000
25%       5.000000
50%       7.000000
75%      15.000000
max      45.000000
dtype: float64

In [18]:
exemplo = serieImpar.value_counts(normalize=True)

exemplo

5     0.4
15    0.2
45    0.2
7     0.2
dtype: float64

In [19]:
exemplo[5]

0.4

### Exercícios

1) Crie uma Series com os índices registrados pelo TIOBE Index para as top 10 linguagens de programação. Os índices da Series devem ser os nomes das linguagens, e os valores devem ser as taxas de popularidade de cada respectiva linguagem de programação. Em seguida, utilize os métodos da Series para:

* Exibir os cinco primeiros valores da Series
* Exibir os cinco últimos valores da Series

2) Crie uma Series com os 11 primeiros termos da sequência de Fibonacci. Utilize letras (em ordem alfabética) como os índices da Series. Em seguida, obtenha apenas aqueles elementos que forem superiores a 10 e inferiores a 50.

Sequência de Fibonacci: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55...

3) Crie um programa para calcular a média e o desvio padrão de uma series. Observe o exemplo abaixo:

Series
```
0 1
1 2
2 3
3 4
4 5
5 6
6 7
7 8
8 9
9 5
10 3
dtype: int64
```
Saída
```
Média: 4.818181818181818
Desvio Padrão: 2.522624895547565
```

4) Crie um array com 20 números aleatórios inteiros entre 1 e 5. Em seguida, calcule a frequência (percentual) de cada valor específico da Series.

5) Crie um programa para mostrar qual é o valor mais frequente de uma series e, em seguida, substitua todos os demais valores dela por "Outro valor".

6) Crie um array com números entre 1 e 10, com passo 1. Em seguida, embaralhe esses números utilizando o método shuffle do Numpy. Crie uma lista com o fatorial desses números, nessa nova ordem (após o embaralhamento). Por fim, crie uma Series cujo os valores são os fatoriais (embaralhados) e os índices são os números associados ao fatorial.

Exemplo de saída
```
3           6
5         120
1           1
9      362880
4          24
7        5040
10    3628800
2           2
6         720
8       40320
dtype: int64 
```

### DataFrame

In [21]:
import pandas as pd

dicionario = {
    'Ouro':[39, 38, 27],
    'Prata':[41, 32, 14]
}

paises = ['EUA', 'China', 'Japão']

medalhas = pd.DataFrame(dicionario, index=paises)

medalhas

       Ouro  Prata
EUA      39     41
China    38     32
Japão    27     14

In [22]:
# sintaxe para pegar diretamente uma coluna:
medalhas['Ouro']

EUA      39
China    38
Japão    27
Name: Ouro, dtype: int64

In [23]:
# Como obter medalhas de prata do Japão?

medalhas.loc['Japão', 'Prata']

14

In [24]:
# forma alternativa usando números ao invés de nomes:
medalhas.iloc[2, 1]

14

In [29]:
# acrescentando uma coluna nova:
medalhas['Bronze'] = [33, 18, 17]

medalhas

       Ouro  Prata  Bronze
EUA      39     41      33
China    38     32      18
Japão    27     14      17

In [30]:
# o que acontece se usarmos as funções estatísticas (sum, mean, std etc) no dataframe?

medalhas.sum()

Ouro      104
Prata      87
Bronze     68
dtype: int64

In [31]:
# e se quiséssemos por linha, e não por coluna?

medalhas.sum(axis=1)

EUA      113
China     88
Japão     58
dtype: int64

In [36]:
medalhas['Total'] = medalhas.sum(axis=1)

medalhas

       Ouro  Prata  Bronze  Total
EUA      39     41      33    226
China    38     32      18    176
Japão    27     14      17    116

In [49]:
# outra forma:

medalhas['Total'] = medalhas['Ouro'] + medalhas['Prata'] + medalhas['Bronze']

medalhas

       Ouro  Prata  Bronze  Total
EUA      39     41      33    113
China    38     32      18     88
Japão    27     14      17     58

In [34]:
# países com menos do que 30 bronzes:
medalhas[ medalhas['Bronze'] < 30]

       Ouro  Prata  Bronze  Total
China    38     32      18     88
Japão    27     14      17     58

In [37]:
exemplo = pd.DataFrame({
    'Coluna1':[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Coluna2':[0, 9, 8, 7, 6, 5, 4, 3, 2, 1]
})

exemplo

   Coluna1  Coluna2
0        1        0
1        2        9
2        3        8
3        4        7
4        5        6
5        6        5
6        7        4
7        8        3
8        9        2
9       10        1

In [38]:
exemplo.head() # mostra as 5 primeiras linhas

   Coluna1  Coluna2
0        1        0
1        2        9
2        3        8
3        4        7
4        5        6

In [39]:
# podemos passar quantidades arbitrárias de linhas:

exemplo.head(3)

   Coluna1  Coluna2
0        1        0
1        2        9
2        3        8

In [41]:
exemplo.tail(2) # tail mostra as últimas linhas (por padrão, 5)

   Coluna1  Coluna2
8        9        2
9       10        1

In [42]:
exemplo.sample() # Mostra uma linha aleatória do DataFrame

   Coluna1  Coluna2
4        5        6

In [43]:
exemplo.sample()

   Coluna1  Coluna2
3        4        7

In [44]:
exemplo.sample(4)

   Coluna1  Coluna2
2        3        8
9       10        1
3        4        7
4        5        6

In [46]:
novoExemplo = exemplo.drop(4, axis=0)

novoExemplo

   Coluna1  Coluna2
0        1        0
1        2        9
2        3        8
3        4        7
5        6        5
6        7        4
7        8        3
8        9        2
9       10        1

In [47]:
exemplo.drop(8, axis=0, inplace=True)

exemplo

   Coluna1  Coluna2
0        1        0
1        2        9
2        3        8
3        4        7
4        5        6
5        6        5
6        7        4
7        8        3
9       10        1

In [48]:
# outra forma:

dfVazio = pd.DataFrame()

dfVazio['Coluna1'] = [1, 2, 3]
dfVazio['Coluna2'] = [4, 5, 6]

dfVazio

   Coluna1  Coluna2
0        1        4
1        2        5
2        3        6

### Exercícios

## Exercícios

1) Em um concurso público foram contabilizados os números de pessoas inscritas (até a data inicialmente estabelecida para a inscrição) segundo os níveis de escolaridade: fundamental completo, médio completo, superior completo e pós-graduação completa. Segue abaixo a tabela com os valores observados.


| Nível de escolaridade | Inscritos |
| --- | --- |
| Fundamental completo | 451 |
| Médio completo  | 627 |
| Superior completo | 292 |
| Pós-graduação completa  | 95 |

Com base na tabela acima, crie uma Series com esses valores e calcule:

(a) O número total de inscritos

(b) Número inscritos que possuem, pelo menos, o superior completo.

(c) Suponha que a inscrição foi prorrogada e, com isso, foi obtido um número adicional de inscrições: 68, 93, 22 e 0 inscritos a mais em cada uma das categorias de escolaridade apresentados na tabela acima (na mesma ordem). Assim, crie uma nova Series com esses valores.

(d) Utilizando as duas Series que você tem, calcule o número total de inscritos após a prorrogação do período de inscrições.

2) Uma turma de cinco alunos foi submetida a uma avaliação e a nota de cada um dos alunos é apresentada na tabela abaixo:

| Nome do Aluno |	Nota |
| --- | --- |
| Wilfred |	2 |
| Abbie |	7 |
| Harry | 5.5 |
| Julia | 10 |
| Carrie | 6.2 |

(a) Crie uma Series com os valores da tabela acima.

(b) Retorne o número de alunos que foram aprovados (considerando que a nota mínima para a aprovação é 7).

(c) Qual foi a nota média da turma.

(d) Obtenha o nome dos alunos que tiraram notas acima da média da turma.

3) Crie um objeto DataFrame que contenha os dados da tabela abaixo, os quais se referem ao peso, altura e idade de cinco pessoas:

| Peso (kg) |	Altura (cm) |	Idade |
| --- | --- | --- |
| 72	| 180	| 31 |
| 80	| 170	| 21 |
| 60	| 175	| 16 |
| 90	| 174	| 28 |
| 100	| 185	| 23 |

Com base no DataFrame criado, realize o que pedido nos itens abaixo:

(a) Visualize apenas os dados da coluna que contém a altura das pessoas.

(b) Obtenha a idade média das pessoas.

(c) Obtenha os dados das pessoas que estão abaixo da altura média.

(d) Crie um nova coluna no DataFrame que contenha o IMC (Índice de Massa Corporal) de cada pessoa.

(e) Remova a coluna que contém a idade das pessoas.

(f) *Desafio: Salve esses dados do DataFrame em um arquivo csv*.